<a href="https://colab.research.google.com/github/RudinP/SOLUX_Summer_data_study/blob/master/2%EC%A3%BC%EC%B0%A8/%EC%B1%95%ED%84%B012(0802).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd

In [ ]:
date_list=[{'date':'2000-06-27'},
          {'date':'2002-09-24'},
          {'date':'2005-12-20'},]
df=pd.DataFrame(date_list,columns=['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [ ]:
def extract_year(date):
    return date.split('-')

In [ ]:
df['year']=df['date'].map(extract_year)#apply와 같은 방법
df

         date            year
0  2000-06-27  [2000, 06, 27]
1  2002-09-24  [2002, 09, 24]
2  2005-12-20  [2005, 12, 20]

In [ ]:
job_list=[{'age':20,'job':'student'},
          {'age':30,'job':'developer'},
          {'age':30,'job':'teacher'},]
df=pd.DataFrame(job_list)
df

   age        job
0   20    student
1   30  developer
2   30    teacher

In [ ]:
df.job=df.job.map({'student':1,"developer":2,'teacher':3})#map으로딕셔너리를 직접 전달하여 문자에서 숫자로 변경 가능

In [ ]:
df

   age  job
0   20    1
1   30    2
2   30    3

In [ ]:
x_y=[{'x':5.5,'y':-5.6,'z':-1.1},
    {'x':-5.2,'y':-5.5,'z':-2.2},
    {'x':-1.6,'y':-4.5,'z':-3.3},]
df=pd.DataFrame(x_y)
df

     x    y    z
0  5.5 -5.6 -1.1
1 -5.2 -5.5 -2.2
2 -1.6 -4.5 -3.3

In [ ]:
#모든 column에 적용하고싶으면 applymap을 사용

In [ ]:
import numpy as np

In [ ]:
df=df.applymap(np.around)#반올림을 모든column에 적용

In [ ]:
df

     x    y    z
0  6.0 -6.0 -1.0
1 -5.0 -6.0 -2.0
2 -2.0 -4.0 -3.0